class Privacy0 {
  static const String headText = '개인정보 수집 및 이용동의';
  static const String mainContent1 = '''
(주)비사이드코리아는 아래의 목적으로 개인정보를 수집 및 이용하며, 회원의 개인정보를 안전하게 취급하는데 최선을 다합니다.
''';
  static const String mainContent2 = '''
1. 목적 : 서비스 이용에 따른 본인(주주)확인 및 가입자 식별, 주주명부 기재 정보와의 대조, 홈페이지 및 앱 회원 서비스 제공을 위한 회원인증 및 확인

2. 항목 : 아이디(이메일주소), 비밀번호, 이름, 생년월일, 주민등록번호, 휴대폰번호, 집주소, 기기정보, 인증서 정보, 신분증 사본

**3. 보유기간 : 회원 탈퇴 시까지 보유** 

위 개인정보 수집에 대한 동의를 거부할 권리가 있으며, 동의 거부 시에는 서비스 이용에 제한될 수 있습니다.

더 자세한 내용에 대해서는 홈페이지에 있는 비사이드코리아 개인정보처리방침을 참고하시길 바랍니다.
''';
}

class Service0 {
  static const String headText = '이용약관';
  static const String mainContent = '''
### **제 1 조 [목적]**

본 약관은 비사이드코리아 주식회사(이하 “회사”라 합니다)가 제공하는 서비스 이용과 관련하여, 회사와 회원 간 권리, 의무 및 책임사항, 기타 필요한 사항을 규정함을 목적으로 합니다.

### **제 2 조 [정의]**

이 약관에서 사용하는 용어의 정의는 다음과 같습니다.

1. "서비스"란 구현되는 단말기(PC, 휴대형단말기 등의 각종 유무선 장치를 포함)와 상관없이 회원이 이용할 수 있는 비사이드 서비스 및 이와 관련된 제반 서비스를 의미합니다.
2. "회원"이란 "서비스"에 접속하여 이 약관에 따라 "회사"와 이용계약을 체결하고, "회사"가 제공하는 "서비스"를 이용하는 고객을 말합니다.
3. "아이디(ID 또는 계정)"라 함은 회원이 본 약관 및 개인정보처리방침에 동의한 후 회사가 회원을 식별하고 서비스를 제공하기 위해 회원에게 부여한 문자 또는 숫자의 조합을 말합니다.
4. "닉네임"이라 함은 서비스 이용을 위해, 본 약관 및 개인정보처리방침에 동의한 회원이 정하고 회사가 수집하는 회원의 고유한 이름(문자와 숫자의 조합)을 말합니다.
5. "게시물"이란 "회원"이 "서비스"를 이용하면서 "서비스"에 게시한 부호, 문자, 도형, 색채, 음성, 음향, 이미지, 영상 등(이들의 복합체를 포함한다.) 온라인 디지털 형태의 정보나 자료를 말합니다.

### **제 3 조 [약관의 게시와 개정]**

① "회사"는 이 약관의 내용을 "회원"이 쉽게 알 수 있도록 "서비스" 내 또는 연결화면을 통하여 게시합니다.

② "회사"는 필요한 경우 관련 법령을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.

③ "회사"가 이 약관을 개정할 경우에는 개정내용과 적용일자를 명시하여 "서비스"에서 적용일자 7일 전부터 적용일자 전일까지 공지합니다. 다만, "회원"에게 불리한 변경의 경우에는 적용일자 30일 전부터 공지합니다.

④ "회사"가 전항에 따라 공지하면서 "회원"에게 적용일자 전일까지 의사표시를 하지 않으면 의사표시가 표명된 것으로 본다는 뜻을 명확하게 공지하였음에도 "회원"이 명시적으로 거부의 의사표시를 하지 아니한 경우 "회원"이 개정약관에 동의한 것으로 봅니다.

⑤ "회원"은 개정 약관에 동의하지 않는 경우 적용일자 전일까지 "회사"에 거부의사를 표시하고 "서비스" 이용계약을 해지할 수 있습니다.

### **제 4 조 [약관의 해석]**

① "회사"는 이 약관 외에 별도의 운영정책을 둘 수 있습니다.

② 이 약관에서 정하지 아니한 사항이나 해석에 대해서는 운영정책, 이용안내, 관련 법령에 따릅니다.

### **제 5 조 [이용계약 체결]**

① 이용계약은 "회원"이 되고자 하는 자(이하 "가입신청자"라고 합니다)가 "회사"가 제공하는 약관의 내용에 대하여 동의를 한 다음 "회사"가 정한 절차에 따라 가입신청을 완료하고, "회사"가 이러한 신청에 대하여 승낙함으로써 체결됩니다.

② 이“회사"는 "가입신청자"의 신청에 대하여 아래 각 호에 해당하는 사유가 있는 경우에는 승낙을 하지 않을 수 있으며, 가입 이후에도 아래 각 호의 사유가 확인될 경우에는 승낙을 취소하거나 이용계약을 해지할 수 있습니다.

1. “가입신청자"가 이 약관에 의하여 이전에 "회원"자격을 상실한 적이 있는 경우
2. 실명이 아닌 명의 또는 타인의 명의를 이용한 경우
3. 허위 또는 잘못된 정보를 기재 또는 제공하거나, "회사"가 제시하는 내용을 기재하지 않은 경우
4. "가입신청자"의 귀책사유로 인하여 승인이 불가능하거나 기타 이 약관에서 규정한 제반 사항을 위반하며 신청하는 경우
5. 부정한 용도 또는 영리를 추구할 목적으로 “서비스”를 이용하고자 하는 경우
6. 관련법령에 위배되거나 사회의 안녕질서 혹은 미풍양속을 저해할 수 있는 목적으로 신청한 경우
7. 기타 이 약관에 위배되거나 위법 또는 부당한 이용신청임이 확인된 경우 또는 “회사”가 합리적인 판단에 의하여 필요하다고 인정하는 경우

③ 이용계약의 성립 시기는 "회사"가 계정 생성 완료를 신청절차상에서 표시하거나 제17조의 방식에 따른 통지가 "가입신청자"에게 도달한 시점으로 합니다.

### **제 6 조 ["회원" 정보의 변경]**

① "회원"은 "서비스"를 통하여 언제든지 본인의 개인정보를 열람하고 수정할 수 있습니다. 다만, "서비스" 관리를 위해 필요한 "아이디"는 수정이 불가능합니다.

② "회원"은 회원가입신청 시 기재한 사항이 변경되었을 경우 "서비스"에서 직접 수정하거나 고객센터를 통하여 "회사"에 변경 사항을 통지하여야 합니다.

③ "회원"이 전항의 변경사항을 "회사"에 통지하지 않아 발생한 불이익에 대하여 "회사"는 책임을 지지 않습니다.

### **제 7 조 ["회원"의 닉네임 관리 의무]**

① "회사"는 "회원"의 "닉네임"이 개인정보 유출 우려가 있거나, 반사회적 또는 미풍양속에 어긋나거나 "회사" 및 "회사"의 운영자로 오인할 우려가 있는 경우, 해당 "닉네임"의 이용을 제한할 수 있습니다.

② "회원"은 비밀번호가 도용되거나 제3자가 사용하고 있음을 안 경우 이를 즉시 "회사"에 통지하고 "회사"의 안내에 따라야 합니다.

③ "회원"이 전항을 준수하지 않아 발생한 불이익에 대하여 "회사"는 책임을 지지 않습니다. 다만, 회사의 고의 또는 과실에 의한 경우에는 그러하지 아니합니다.

### **제 8 조 [개인정보의 보호]**

"회사"는 정보통신망 이용촉진 및 정보보호 등에 관한 법률, 개인정보보호법 등 관련 법령이 정하는 바에 따라 "회원"의 개인정보를 보호하기 위해 노력합니다. 개인정보의 보호 및 이용에 대해서는 관련 법령 및 "회사"의 개인정보처리방침이 적용됩니다. 다만, "회사"가 제작한 화면 이외의 링크된 화면 등에서는 "회사"의 개인정보처리방침이 적용되지 않습니다.

### **제 9 조 ["회사"의 의무]**

① "회사"는 관련 법령과 이 약관을 준수하며, 계속적이고 안정적으로 "서비스"를 제공하기 위하여 최선을 다하여 노력합니다.

② "회사"는 "회원"이 안전하게 "서비스"를 이용할 수 있도록 개인정보(신용정보 포함)보호를 위해 보안시스템을 갖출 수 있으며, 개인정보처리방침을 공시하고 준수합니다.

③ "회사"는 "서비스" 이용과 관련하여 "회원"으로부터 제기된 의견이나 불만이 정당하다고 인정할 경우에는 이를 처리하여야 하며, "서비스" 내 게시판, 전자우편 등을 통하여 "회원"에게 처리과정 및 결과를 전달할 수 있습니다.

### **제 10 조 ["회원"의 의무]**

① "회원"은 아래의 행위를 하여서는 안 됩니다.

1. 타인의 정보도용
2. "회사"가 게시한 정보의 변경
3. "회사"가 정한 정보 이외의 정보(컴퓨터 프로그램 등) 등의 송신 또는 게시
4. "회사"와 기타 제3자의 저작권 등 지적재산권에 대한 침해
5. "회사" 및 기타 제3자의 명예를 손상시키거나 업무를 방해하는 행위
6. 외설 또는 폭력적인 메시지, 화상, 음성, 허위사실, 기타 공서양속에 반하는 정보를 "서비스"에 공개 또는 게시하는 행위
7. "회사"의 사전 동의 없이 영리를 목적으로 "서비스"를 사용하는 행위
8. 회사의 사전 승낙 없이 에이전트(Agent), 스크립트(Script), 스파이더(Spider), 스파이웨어(Spyware), 툴바(Toolbar) 등의 자동화된 수단, 기타 부정한 방법을 통하여 서비스에 접속하는 행위, 노출횟수 및 클릭횟수를 부정하게 생성하거나 증가시키는 행위, 서비스 이용 신청을 하는 행위, 회사의 서버에 부하를 일으키는 행위
9. 다른 "회원"의 개인정보 및 계정정보를 수집하는 행위
10. 기타 불법적이거나 부당한 행위

② 회원은 관계 법령, 이용약관, 이용안내 등 서비스와 관련하여 회사가 공지하거나 통지한 사항 등을 준수하여야 하며, 기타 회사의 업무에 방해되는 행위를 하여서는 안 됩니다.

### **제 11 조 ["게시물"의 저작권]**

① "회원"이 "서비스" 내에 게시한 "게시물"의 저작권은 저작권법에 의하여 보호를 받으며, 적법한 절차와 방법으로 "회사"에 다음과 같이 사용할 수 있는 영구적인 라이선스를 제공합니다. 상기 라이선스의 사용 및 허용 범위는 아래와 같습니다.

1. "서비스"의 운영, 향상, 개선, 신규 서비스 개발, 프로모션 등을 위하여 "게시물"을 사용, 편집, 저장, 복제, 수정, 공개, 전송, 공개적 실연, 공개적인 게시, 배포할 수 있는 권리
2. "게시물"의 2차적 저작물을 제작 및 배포할 수 있는 권리
3. "서비스" 홍보를 위한 목적으로 미디어, 통신사 등이 "게시물"의 내용을 보도, 방영하게 할 수 있는 권리

② "회사"가 전항 이외의 방법으로 "회원"의 "게시물"을 이용하고자 하는 경우에는 전화, 문자, 전자우편 등을 통해 사전에 "회원"의 동의를 얻을 수 있습니다.

③ "회원"이 이용계약을 해지하거나 제19조에 의해 이용계약이 해지되는 경우에도 "서비스"의 운영 향상, 개선, 홍보 등 제1항에 규정된 목적 범위 내에서 본 라이선스는 존속됩니다.

### **제 12 조 ["게시물"의 이용권]**

① "회원"의 "게시물"을 임의로 무단 사용하여 발생하는 손실이나 기타의 문제는 전적으로 "회원" 개인의 판단에 따른 책임이며, "회사"는 이에 대하여 책임지지 않습니다.

② "회원"은 타인의 초상권, 저작권 등 지적재산권 및 기타 권리를 침해하는 목적으로 "게시물"을 사용할 수 없으며, 만일 타인의 권리를 침해하는 행위로 인하여 발생하는 결과에 대한 모든 책임은 "회원" 본인에게 있습니다.

③ "회원"은 본 서비스에 게시된 "게시물"을 무단으로 상업적이거나 기타 개인적인 이익을 위한 용도로 사용할 수 없습니다.

④ "회원"은 본 서비스에 게시된 "게시물"을 무단 도용하여 "회사"에 피해를 입힌 경우, 법적인 절차에 따라 보상해야 합니다.

### **제 13 조 ["게시물"의 관리 및 권리의 귀속]**

① "회원"의 "게시물"은 타인의 저작권을 침해하거나 허위 사실을 내용으로 하여서는 아니됩니다. "회원"의 "게시물"이 정보통신망 이용촉진 및 정보보호 등에 관한 법률 및 저작권법 등 관련 법령에 위반되는 내용을 포함하는 경우, 권리자는 관련 법령이 정한 절차에 따라 해당 "게시물"의 게시중단 및 삭제 등을 요청할 수 있으며, "회사"는 관련 법령에 따라 조치를 취하여야 합니다.

② "회사"는 전항에 따른 권리자의 요청이 없는 경우라도 권리침해가 인정될 만한 사유가 있거나, 허위 사실로 판단되거나, 기타 회사 정책 및 관련 법령에 위반될 경우에는 관련 법령에 따라 해당 "게시물"에 대하여 게시거부나 삭제 등의 조치를 취할 수 있습니다. 다만, “회사”가 모든 "게시물"을 검토할 의무가 있는 것은 아닙니다.

③ "서비스"에 대한 저작권 및 지식재산권은 "회사"에 귀속됩니다.

④ "회사"는 "서비스"와 관련하여 "회원"에게 "회사"가 정한 이용조건에 따라 "서비스" 등을 이용할 수 있는 이용권만을 부여하며, "회원"은 이를 양도, 판매, 담보제공 등의 처분행위를 할 수 없습니다.

### **제 14 조 ["서비스"의 제공 등]**

① "회사"는 "서비스"를 일정범위로 분할하여 각 범위 별로 이용가능시간을 별도로 지정할 수 있습니다. 다만 이러한 경우에는 그 내용을 사전에 공지합니다.

② "서비스"는 연중무휴, 1일 24시간 제공함을 원칙으로 합니다.

③ "회사"는 컴퓨터 등 정보통신설비의 보수점검, 교체 및 고장, 통신두절 또는 운영상 합리적인 이유가 있는 경우 서비스의 제공을 일시적으로 중단할 수 있습니다. 이 경우 "회사"는 제17조에 따른 방법으로 "회원"에게 통지합니다. 다만, "회사"가 사전에 통지할 수 없는 부득이한 사유가 있는 경우 사후에 통지할 수 있습니다.

④ "회사"는 서비스의 제공에 필요한 경우 정기점검을 실시할 수 있으며, 정기점검시간은 서비스제공화면에 공지한 바에 따릅니다.

### **제 15 조 ["서비스"의 변경]**

① 회사"는 안정적인 "서비스" 제공을 위하여 "서비스"의 내용, 운영상, 기술상 사항 등을 변경할 수 있습니다.

② "회사"는 "서비스"를 변경할 경우 변경내용과 적용일자를 명시하여 사전에 공지합니다. 단, "회원"의 권리나 의무 및 "서비스"의 이용과 관련되는 실질적인 사항을 변경할 경우 적용일자 7일 전부터 공지하며, "회원"에게 불리한 변경의 경우 적용일자 30일 전부터 공지합니다.

③ "회원"은 "서비스" 변경에 동의하지 않을 경우 "회사"에 거부의사를 표시하고 이용계약을 해지할 수 있습니다.

④ "회사"는 "서비스" 제공과 관련한 회사 정책의 변경 등 상당한 이유가 있는 경우에 운영상, 기술상의 필요에 따라 제공하고 있는 전부 또는 일부 "서비스"를 변경 또는 중단할 수 있으며, 이에 대해 관련 법령에 특별한 규정이 없는 한 "회원"에게 별도의 보상을 하지 않습니다.

### **제 16 조 ["회원"에 대한 통지]**

1. "회사"가 "회원"에 대하여 통지를 하는 경우 이 약관에 별도의 규정이 없는 한 "회원"이 제공한 전자우편주소 등으로 할 수 있습니다.
2. "회사"는 "회원" 전체에 대하여 통지를 하는 경우 7일 이상 "서비스" 내 게시판에 게시함으로써 전항의 통지에 갈음할 수 있습니다.

### **제 17 조 [이용제한 등]**

① "회사"는 "회원"이 관련 법령 및 이 약관의 의무를 위반하거나 "서비스"의 정상적인 운영을 방해한 경우, 아래 각 호와 같이 경고, 일시정지, 이용계약해지 등으로 "서비스" 이용을 단계적으로 제한할 수 있습니다.

1. 약관 위반 - 경고
2. 경고 3회 누적 - 일시정지 (30일 간 로그인 제한)
3. 일시정지 후 재경고 - 이용계약해지 (재가입 제한)

② "회사"는 전항에도 불구하고, 저작권법을 위반한 불법프로그램의 제공 및 운영방해, 정보통신망이용촉진 및 정보보호 등에 관한 법률을 위반한 불법통신 및 해킹, 악성프로그램의 배포, 접속권한 초과행위 등과 같이 관련 법령을 위반한 경우에는 즉시 이용계약을 해지할 수 있습니다. 본 항에 따른 이용계약 해지 시 "서비스" 이용을 통해 획득한 모든 혜택이 소멸되며, "회사"는 이에 대해 별도로 보상하지 않습니다.

③ "회사"는 본 조의 이용제한 범위 내에서 제한의 조건 및 세부내용을 운영정책, 이용안내 등에서 더 구체적으로 정할 수 있습니다.

④ 본 조에 따라 "서비스" 이용을 제한하거나 이용계약을 해지하는 경우에는 "회사"는 제17조에 따른 방법으로 "회원"에게 통지합니다.

⑤ "회원"은 본 조에 따른 이용제한 등에 대해 "회사"가 정한 절차에 따라 이의신청을 할 수 있습니다. 이 때 이의가 정당하다고 "회사"가 인정하는 경우 "회사"는 즉시 "서비스"의 이용을 재개합니다.

### **제 18조 [광고성 또는 맞춤형 정보의 제공]**

① 회사는 본 서비스의 운영과 관련하여 광고성 정보를 제공하는 서비스를 운영할 수 있습니다.

② 회사는 광고성 정보 및 회원 맞춤형 정보를 문자 메세지나 푸쉬 메세지 형식으로 제공할 수 있으며, 이는 광고성 정보에 대한 사전 수신 동의가 있는 경우 등 법령상 허용된 경우에 한하여 제공됩니다.

### **제 19 조 [이용계약 해지]**

① "회원"은 언제든지 "서비스" 내 정보 관리 메뉴 또는 고객센터 등을 통하여 이용계약 해지를 신청할 수 있으며, "회사"는 관련 법령이 정하는 바에 따라 이를 즉시 처리하여야 합니다.

② "회사"는 "회원"에게 다음과 같은 사유가 발생할 경우 시정을 요구할 수 있으며, “회원”이 시정을 거부하거나, 2회 이상 해지 사유 발생 시 이용계약을 해지할 수 있습니다.

1. 본 약관을 위반한 경우
2. 관계 법령을 위반한 경우
3. 회사가 제공하는 "서비스"의 원활한 진행을 방해하는 행위를 하거나 시도한 경우
4. 기타 "회사"가 합리적인 판단에 기하여 "서비스"의 제공을 거부할 필요가 있다고 인정할 경우

③ 이용계약 해지가 완료되는 경우 관련 법령 및 개인정보처리방침에 따라 "회사"가 보유하여야 하는 정보를 제외한 모든 "회원"의 정보가 삭제됩니다.

④ 전항에도 불구하고 제2항에 따라 "회사"가 이용계약을 해지하는 경우 "회사"는 "회원"의 이의신청 접수 및 처리 등을 위하여 일정 기간 동안 "회원"의 정보를 보관할 수 있으며, 해당 기간이 경과한 후에 "회원"의 정보를 삭제합니다.

### **제 20 조 [책임제한]**

① 비사이드에서 제공하는 데이터 및 분석자료는 투자를 위한 정보제공을 목적으로 하는 것이며, 투자 및 주식 거래를 목적으로 하지 않습니다. 따라서 비사이드 및 정보제공자가 제공하는 정보에는 오류가 있을 수 있고, 서비스가 지연될 수도 있으며, 이러한 정보의 오류나 서비스의 지연에 대해 "회사" 및 정보제공자는 어떠한 책임도 지지 않습니다.

② 비사이드에서 제공하는 서비스 및 서비스를 이용하여 얻은 정보에 따른 투자는 손실이 발생할 수 있으며, 이에 대한 최종 판단은 이용자 자신이 하여야 하고, 그에 따른 책임은 전적으로 이용자 자신에게 있으며, "회사"는 그로 인하여 발생하는 손해에 대해서 어떠한 책임도 지지 않습니다.

③ 비사이드의 게시판에 게시된 정보나 의견, 자료 등은 "회사"와 아무런 관련이 없으며 게시물의 내용과 관련하여 발생한 법적 책임은 게시자 또는 이를 열람하는 이용자가 부담하여야 합니다. "회사"는 "회원"간 또는 "회원"과 제3자 간에 서비스를 매개하여 발생한 분쟁에 관여할 법적 의무가 없으며, 이와 관련하여 어떠한 책임도 지지 않습니다.

④ "회사"는 천재지변, 디도스(DDOS)공격, IDC장애, 기간통신사업자의 회선 장애 또는 이에 준하는 불가항력으로 인하여 "서비스"를 제공할 수 없는 경우에는 "서비스" 제공에 관한 책임이 면제됩니다.

⑤ "회사"는 "회원"의 귀책사유로 인한 "서비스" 이용의 장애에 대하여는 “회사”의 고의 또는 과실이 없는 한 책임을 지지 않습니다.

⑥ "회사"는 "회원"이 "서비스"와 관련하여 게재한 정보, 자료, 사실의 신뢰도, 정확성, 적법성 등에 관하여는 책임을 지지 않습니다.

⑦ "회사"는 무료로 제공되는 "서비스" 이용과 관련하여 관련 법령에 특별한 규정이 없는 한 책임을 지지 않습니다.

⑧ "회원"이 "서비스"를 이용함에 있어 "회원" 본인이 행한 불법행위나 이 약관 위반행위로 인하여 회사가 해당 회원 이외의 제3자로부터 손해배상 청구 또는 소송을 비롯한 각종 이의제기를 받는 경우 해당 "회원"은 자신의 책임과 비용으로 반드시 "회사"를 면책 시켜야 합니다.

### **제 21 조 [준거법 및 재판관할]**

① "회사"와 "회원"간 발생한 분쟁에 대하여는 대한민국법을 준거법으로 합니다.

② "회사"와 "회원"간 발생한 분쟁에 관한 소송은 서울중앙지방법원을 전속적 관할법원으로 합니다.

본 이용약관은 2022년 02월 21일부터 적용됩니다.
 ''';
}
